
const DOUGH_TYPE = {
    "紅龜(紅豆)":35,
    "紅龜(綠豆)":35,
    "紅龜(白豆)":35,
    "紅龜(沒指定)":35,
    "紅龜1斤(紅豆)":150,
    "紅龜1斤(綠豆)":150,
    "紅龜1斤(白豆)":150,
    "紅龜1斤(沒指定)":150,
    "紅龜2斤(紅豆)":300,
    "紅龜2斤(綠豆)":300,
    "紅龜2斤(白豆)":300,
    "紅龜2斤(沒指定)":300,
    "壽桃(紅豆)":30,
    "壽桃(綠豆)":30,
    "壽桃(白豆)":30,
    "壽桃(沒指定)":30,
    "壽桃(奶酥)":30,
    "大壽桃(紅豆)":50,
    "大壽桃(綠豆)":50,
    "大壽桃(白豆)":50,
    "大壽桃(沒指定)":50,
    "錢":20,
    "小圓":20,
    "大圓(紅豆)":35,
    "大圓(綠豆)":35,
    "大圓(白豆)":35,
    "大圓(沒指定)":35,
    "毛呼":35,
    "裂桃":35,
    "黑糖發糕":35,
    "大黑糖發糕":120,
    "粉紅發糕":35,
    "大粉紅發糕":120,
    "麵線":30,
}

const TOWER_TYPE = {
    "壽桃塔":1,
    "中壽桃塔":1,
    "大壽桃塔":1,
    "壽麵塔":1,
    "中壽麵塔":1,
    "大壽麵塔":1,
    "果凍塔":1,
    "中果凍塔":1,
    "大果凍塔":1,
    "沙琪瑪塔":1,
    "中沙琪瑪塔":1,
    "大沙琪瑪塔":1,
    "12小時香塔":1,
    "24小時香塔":1,
    "小貢香塔":1,
    "細香塔":1,
}

const COMMON_CAKE = {
    "綠豆椪":60,
    "綠豆滷肉":65,
    "咖哩餅":65,
    "白豆餅":60,
    "小鳳梨餅":60,
    "小烏豆沙餅":60,
    "鳳梨酥":60,
}

const UNCOMMON_CAKE = {
    "大鳳梨餅":190,
    "大烏豆沙餅":190, 
    "小芝麻餅":60,
    "大芝麻餅":200,
    "小蛋糕":30,
    "大蛋糕":160,
}

const MOON_CAKE = {
    "蛋黃酥":55,
    "素綠豆椪":60,
    "素咖哩餅":60,
    "素綠豆滷肉":65,
    "鴛鴦餅":65,
    "抹茶中式月餅":65,
    "抹茶中式小月餅":45,
    "地瓜中式月餅":65,
    "地瓜中式小月餅":45,
    "拿鐵中式月餅":65,
    "拿鐵中式小月餅":45,
    "百香金柚中式月餅":65,
    "百香金柚中式小月餅":45,
    "鐵觀音中式月餅":70,
    "鐵觀音中式小月餅":45,
    "棗泥中式月餅":70,
    "棗泥中式小月餅":45,
    "白豆沙中式小月餅":45,
    "烏豆沙中式小月餅":45,
}

const GIFT_BOX = {
    "禮盒4大6小":800,
    "禮盒6大8小":580,
    "鳳梨酥12入禮盒":480,
    "中式12入禮盒":780,
    // "中式12入禮盒(無葷肉)":700,
    "中式10入禮盒":650,
    // "中式10入禮盒(無葷肉)":600,
    "中式8入禮盒":520,
    // "中式8入禮盒(無葷肉)":480,
    "中式6入禮盒":390,
    // "中式6入禮盒(無葷肉)":360,
    "蛋黃酥20入禮盒":1100,
    "蛋黃酥15入禮盒":825,
    "蛋黃酥12入禮盒":660,
    "蛋黃酥10入禮盒":550,
}

const GUEI = {
    "沙琪瑪龜":250,
    "綠豆椪龜":280,
    "咖哩餅龜":300,
    "麵線龜":150,
    "蛋糕龜":280,
    "鳳梨酥龜":350,
    "果凍龜":160,
    "鳳片龜":150,
    "鳳梨餅龜":280,
    "烏豆沙餅龜":280,
    "綜合餅龜":1,
}

const SPECIAL = {
    "大桃子36粒壽桃的":1500,
    "大餅桃36粒綠豆椪":1800,
    "沙琪瑪豬公":280,
    "鳳片豬羊":150,
}

const STACKED_ITEM = {
    ...GUEI,
    ...GIFT_BOX
}

const ALL_ITEM = {
    ...DOUGH_TYPE,
    ...TOWER_TYPE,
    ...COMMON_CAKE,
    ...UNCOMMON_CAKE,
    ...MOON_CAKE,
    ...SPECIAL,
    ...STACKED_ITEM,
}


const ALL_ITEM_LIST = Object.keys(ALL_ITEM)

export function hasSubItems(item_name){
    return (STACKED_ITEM[item_name] !== undefined) ? true : false;
}

export function getAvailableSnippet(item_name){
    if (hasSubItems(item_name)){
        switch (item_name) {
            case "鳳梨酥12入禮盒":{
                return ["鳳梨酥"]
            }
            case "蛋黃酥20入禮盒":
            case "蛋黃酥15入禮盒":
            case "蛋黃酥12入禮盒":
            case "蛋黃酥10入禮盒":{
                return ["蛋黃酥"]
            }
            case "4大6小禮盒":
            case "6大8小禮盒":{
                return (Object.keys(COMMON_CAKE)).concat(Object.keys(MOON_CAKE))
            }
            case "中式12入禮盒":
            case "中式10入禮盒":
            case "中式8入禮盒":
            case "中式6入禮盒":{
                return [
                    "綠豆椪",
                    "綠豆滷肉",
                    "咖哩餅",
                    "白豆餅",
                    "小鳳梨餅",
                    "小烏豆沙餅",
                    "素綠豆椪",
                    "素咖哩餅",
                    "素綠豆滷肉",
                    "鴛鴦餅",
                    "抹茶中式月餅",
                    "地瓜中式月餅",
                    "拿鐵中式月餅",
                    "百香金柚中式月餅",
                    "鐵觀音中式月餅",
                    "棗泥中式月餅",
                ]
            }
            case "綜合餅龜":{
                return [
                    "綠豆椪(斤)",
                    "咖哩餅(斤)",
                    "小芝麻餅(斤)",
                ]
            }
            case "沙琪瑪龜" :{
                return [
                    "沙琪瑪(斤)"
                ]
            }
            case "綠豆椪龜" :{
                return [
                    "綠豆椪(斤)"
                ]
            }
            case "咖哩餅龜" :{
                return [
                    "咖哩餅(斤)"
                ]
            }
            case "麵線龜" :{
                return [
                    "麵線(斤)"
                ]
            }
            case "蛋糕龜" :{
                return [
                    "蛋糕(斤)"
                ]
            }
            case "鳳梨酥龜" :{
                return [
                    "鳳梨酥(斤)"
                ]
            }
            case "果凍龜" :{
                return [
                    "果凍(斤)"
                ]
            }
            case "鳳片龜" :{
                return [
                    "鳳片(斤)"
                ]
            }
            case "鳳梨餅龜" :{
                return [
                    "鳳梨餅(斤)"
                ]
            }
            case "烏豆沙餅龜" :{
                return [
                    "烏豆沙餅(斤)"
                ]
            }
        }
    }else{
        return ALL_ITEM_LIST;
    }
}
